notes/400-Meaning-兴趣/450-Emacs-神之编辑器/在Emacs中集成Recoll全文搜索.org
#+title: 在 Emacs 中集成 Recoll 全文搜索 
#+options: h:1 num:t toc:t
#+options: html-postamble:nil
#+language:zh-CN 

* 需求

时间一长，平常收集的资料就多了，于是使用了 recoll 全文搜索，但是在Emacs 中工作时
间多，搜索要在 Emacs 和 Recoll 图形界面中来回切换，很不方便。而且，如果本地文件
中找不到，要用搜索引擎到网上搜索的话就更麻烦了，于是想能不能把这需要整合一下，平
时找东西直接开 Recoll 搜索，如果没有的话可以一键切到 Google 搜索结果。

* 解决办法

** 原来的办法

这是在网上搜索到的办法，最大的问题就是你看不到摘要，只有在 minibuffer 中看文件名
 猜其中有啥，如果不是你想要的东西，还得再输入搜索字符串，重来一回，比在 recoll
 图形界面中还要麻烦。
#+begin_src emacs-lisp :tangle yes
 (defun counsel-recoll-function (string &rest _unused)
   "Issue recallq for STRING."
   (if (< (length string) 3)
       (counsel-more-chars 3)
     (counsel--async-command
      (format "recollq -b '%s'" string))
     nil))


 (defun counsel-recoll (&optional initial-input)
   "Search for a string in the recoll database.
 You'll be given a list of files that match.
 Selecting a file will launch `swiper' for that file.
 INITIAL-INPUT can be given as the initial minibuffer input."
   (interactive)
   (ivy-read "recoll: " 'counsel-recoll-function
             :initial-input initial-input
             :dynamic-collection t
             :history 'counsel-git-grep-history
             :action (lambda (x)
                       (when (string-match "file://\\(.*\\)\\'" x)
                         (let ((file-name (match-string 1 x)))
                           (find-file file-name)
                           (unless (string-match "pdf$" x)
                             (swiper ivy-text)))))))
#+end_src

