publish/400-Meaning-兴趣/450-Emacs-神之编辑器/在Emacs中集成Recoll全文搜索.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2021-10-02 Sat 10:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>在 Emacs 中集成 Recoll 全文搜索</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu Peng" />
<link rel='stylesheet' type='text/css' href='file:///home/paul/mynotes/publish/css/org.css' /><link rel='stylesheet' type='text/css' href='file:///home/paul/mynotes/publish/css/header.css' />
</head>
<body>
<div id="preamble" class="status">
<div class="site_header"><div class="site_title" ><div class="title_main">WuPeng's Notes - 我的知识库</div><div class="title_sub">不积跬步，无以至千里；不积小流，无以成江海</div><div class="search"></div></div><div class="nav_bar"><ul><li><a href="file:///home/paul/mynotes/publish/index.html">笔记</a></li><li><a href="file:///home/paul/mynotes/publish/inbox.html">收集</a></li><li><a href="#contact">Contact</a></li><li style="float:right"><a href="file:///home/paul/mynotes/publish/about.html">关于</a></li></ul></div></div>
</div>
<div id="content">
<h1 class="title">在 Emacs 中集成 Recoll 全文搜索</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaec09bc">1. 需求</a></li>
<li><a href="#org3abdc98">2. 解决办法</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaec09bc" class="outline-2">
<h2 id="orgaec09bc"><span class="section-number-2">1</span> 需求</h2>
<div class="outline-text-2" id="text-1">
<p>
时间一长，平常收集的资料就多了，于是使用了 recoll 全文搜索，但是在Emacs 中工作时
间多，搜索要在 Emacs 和 Recoll 图形界面中来回切换，很不方便。而且，如果本地文件
中找不到，要用搜索引擎到网上搜索的话就更麻烦了，于是想能不能把这需要整合一下，平
时找东西直接开 Recoll 搜索，如果没有的话可以一键切到 Google 搜索结果。
</p>
</div>
</div>

<div id="outline-container-org3abdc98" class="outline-2">
<h2 id="org3abdc98"><span class="section-number-2">2</span> 解决办法</h2>
<div class="outline-text-2" id="text-2">
</div>
<ol class="org-ol">
<li><a id="org243f98d"></a>原来的办法<br />
<div class="outline-text-3" id="text-2-1">
<p>
这是在网上搜索到的办法，最大的问题就是你看不到摘要，只有在 minibuffer 中看文件名
 猜其中有啥，如果不是你想要的东西，还得再输入搜索字符串，重来一回，比在 recoll
 图形界面中还要麻烦。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">counsel-recoll-function</span> <span class="org-rainbow-delimiters-depth-2">(</span>string <span class="org-type">&amp;rest</span> _unused<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Issue recallq for STRING."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>&lt; <span class="org-rainbow-delimiters-depth-4">(</span>length string<span class="org-rainbow-delimiters-depth-4">)</span> 3<span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>counsel-more-chars 3<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>counsel--async-command
     <span class="org-rainbow-delimiters-depth-4">(</span>format <span class="org-string">"recollq -b '%s'"</span> string<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    nil<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>


<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">counsel-recoll</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">&amp;optional</span> initial-input<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Search for a string in the recoll database.</span>
<span class="org-doc">You'll be given a list of files that match.</span>
<span class="org-doc">Selecting a file will launch `</span><span class="org-doc"><span class="org-constant">swiper</span></span><span class="org-doc">' for that file.</span>
<span class="org-doc">INITIAL-INPUT can be given as the initial minibuffer input."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-read <span class="org-string">"recoll: "</span> 'counsel-recoll-function
            <span class="org-builtin">:initial-input</span> initial-input
            <span class="org-builtin">:dynamic-collection</span> t
            <span class="org-builtin">:history</span> 'counsel-git-grep-history
            <span class="org-builtin">:action</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-4">(</span>x<span class="org-rainbow-delimiters-depth-4">)</span>
                      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-5">(</span>string-match <span class="org-string">"file://</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\'"</span> x<span class="org-rainbow-delimiters-depth-5">)</span>
                        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-rainbow-delimiters-depth-7">(</span>file-name <span class="org-rainbow-delimiters-depth-8">(</span>match-string 1 x<span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
                          <span class="org-rainbow-delimiters-depth-6">(</span>find-file file-name<span class="org-rainbow-delimiters-depth-6">)</span>
                          <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-7">(</span>string-match <span class="org-string">"pdf$"</span> x<span class="org-rainbow-delimiters-depth-7">)</span>
                            <span class="org-rainbow-delimiters-depth-7">(</span>swiper ivy-text<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
