publish/400-Meaning-兴趣/450-Emacs-神之编辑器/在Emacs中集成Recoll全文搜索.html

<li><a id="org8be6d11"></a>我的解决办法<br />
<div class="outline-text-3" id="text-2-2">
<p>
使用 "recoll -t -A query" 输出查询结果到 Emacs 缓冲中，包含摘要等内容，然后构
建成 html 文档，再用 `eww-display-html' 来显示缓冲。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">recoll-to-html-temmplate</span> <span class="org-string">"~/Templates/recoll-to-html-template.html"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">recoll-to-html</span><span class="org-rainbow-delimiters-depth-2">(</span>query<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Use recoll search local file as eww, require `</span><span class="org-doc"><span class="org-constant">org</span></span><span class="org-doc">',`</span><span class="org-doc"><span class="org-constant">eww</span></span><span class="org-doc">',and recoll installed and indexed.</span>
<span class="org-doc">You can press `n' to call `</span><span class="org-doc"><span class="org-constant">eww-next-url</span></span><span class="org-doc">' google the QUERY."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"sSearch Words:"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">require</span> '<span class="org-constant">org</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">require</span> '<span class="org-constant">eww</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>source nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>google-search-url <span class="org-rainbow-delimiters-depth-5">(</span>format <span class="org-string">"http://www.google.com/search?q=%s"</span> <span class="org-rainbow-delimiters-depth-6">(</span>url-hexify-string query<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>content-tail-marker nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>buffer <span class="org-rainbow-delimiters-depth-5">(</span>get-buffer-create <span class="org-string">"*recoll*"</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">with-current-buffer</span> buffer
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> inhibit-read-only t <span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>display-buffer buffer<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>erase-buffer<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">insert template and goto the body insert point</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert-file-contents <span class="org-rainbow-delimiters-depth-5">(</span>expand-file-name recoll-to-html-temmplate<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-5">(</span>not  <span class="org-rainbow-delimiters-depth-6">(</span>re-search-forward <span class="org-string">"&lt;body&gt;\n&lt;/body&gt;"</span> nil t<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
          <span class="org-rainbow-delimiters-depth-5">(</span>message <span class="org-string">"Invalid html template"</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>- <span class="org-rainbow-delimiters-depth-6">(</span>point<span class="org-rainbow-delimiters-depth-6">)</span> 7<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> marker-beg <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">insert the search result</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert
       <span class="org-rainbow-delimiters-depth-5">(</span>shell-command-to-string
        <span class="org-rainbow-delimiters-depth-6">(</span>format <span class="org-string">"recoll -t -A '%s'"</span> query<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> content-tail-marker <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">change the keyword display color</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>re-search-forward <span class="org-string">"\nABSTRACT\n</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\n/ABSTRACT"</span> nil t<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">save-restriction</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>narrow-to-region <span class="org-rainbow-delimiters-depth-7">(</span>match-beginning 1<span class="org-rainbow-delimiters-depth-7">)</span> <span class="org-rainbow-delimiters-depth-7">(</span>match-end 1<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>goto-char <span class="org-rainbow-delimiters-depth-7">(</span>point-min<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>replace-string query  <span class="org-rainbow-delimiters-depth-7">(</span>concat  <span class="org-string">"&lt;span style=\"color:#F00\"&gt;"</span> query <span class="org-string">"&lt;/span&gt;"</span> <span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-4">)</span>

      <span class="org-comment-delimiter">;; </span><span class="org-comment">insert paragraph tags</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>narrow-to-region marker-beg <span class="org-rainbow-delimiters-depth-5">(</span>point-max<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert <span class="org-string">"&lt;h1&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>forward-line 2<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert <span class="org-string">"&lt;/h1&gt;"</span> <span class="org-string">"\n&lt;p&gt;Search with Google:  &lt;a href=\""</span> google-search-url <span class="org-string">"\"&gt;"</span> query <span class="org-string">"&lt;/a&gt;&lt;/p&gt;"</span> <span class="org-string">"\n&lt;p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>replace-string <span class="org-string">"\nABSTRACT\n"</span> <span class="org-string">"&lt;/p&gt;\n&lt;p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>replace-string <span class="org-string">"\n/ABSTRACT\n"</span> <span class="org-string">"&lt;/p&gt;\n&lt;p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>replace-string <span class="org-string">"\n/ABSTRACT"</span> <span class="org-string">"&lt;/p&gt;\n&lt;p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-max<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert <span class="org-string">"&lt;/p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>re-search-forward <span class="org-string">"bytes\n</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[\n]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> nil t<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>delete-region <span class="org-rainbow-delimiters-depth-6">(</span>match-beginning 1<span class="org-rainbow-delimiters-depth-6">)</span> <span class="org-rainbow-delimiters-depth-6">(</span>match-end 1<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">construct html url href</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>re-search-forward <span class="org-string">"\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\] \\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]"</span> nil t<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-rainbow-delimiters-depth-7">(</span>match-len <span class="org-rainbow-delimiters-depth-8">(</span>length <span class="org-rainbow-delimiters-depth-9">(</span>match-string 0<span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span>
              <span class="org-rainbow-delimiters-depth-7">(</span>esc-str <span class="org-rainbow-delimiters-depth-8">(</span>org-link-escape <span class="org-rainbow-delimiters-depth-9">(</span>match-string 1<span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span>
              <span class="org-rainbow-delimiters-depth-7">(</span>display-str  <span class="org-rainbow-delimiters-depth-8">(</span>match-string 2<span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span>
              <span class="org-rainbow-delimiters-depth-7">(</span>marker-max <span class="org-rainbow-delimiters-depth-8">(</span>point<span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span>
              <span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>delete-region <span class="org-rainbow-delimiters-depth-7">(</span>- marker-max match-len<span class="org-rainbow-delimiters-depth-7">)</span> marker-max<span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>insert <span class="org-string">"&lt;a href=\""</span> esc-str <span class="org-string">"\"&gt;"</span> display-str <span class="org-string">"&lt;/a&gt;"</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-max<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>insert <span class="org-string">"\n&lt;p&gt;Search with Google:  &lt;a href=\""</span> google-search-url <span class="org-string">"\"&gt;"</span> query <span class="org-string">"&lt;/a&gt;&lt;/p&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>widen<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> source <span class="org-rainbow-delimiters-depth-5">(</span>buffer-string<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">display as html by eww</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>eww-display-html 'utf-8 nil nil <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span> buffer<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>linum-mode t<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>read-only-mode t<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>eww-mode<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">with-current-buffer</span> buffer
      <span class="org-rainbow-delimiters-depth-4">(</span>plist-put eww-data <span class="org-builtin">:url</span> <span class="org-string">"Recoll"</span><span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-comment-delimiter">;;</span><span class="org-comment">here any string make `</span><span class="org-comment"><span class="org-constant">eww-next-url</span></span><span class="org-comment">' work</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>plist-put eww-data <span class="org-builtin">:source</span> source<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">used for debug</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>plist-put eww-data <span class="org-builtin">:next</span> google-search-url<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">you can press `n' google the query</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>plist-put eww-data <span class="org-builtin">:title</span> <span class="org-string">"RECOLL SEARCH RESULTS"</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>eww-update-header-line-format<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>old-data eww-data<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>eww-save-history<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> eww-history-position 0<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">dolist</span> <span class="org-rainbow-delimiters-depth-6">(</span>elem '<span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:source</span> <span class="org-builtin">:url</span> <span class="org-builtin">:title</span> <span class="org-builtin">:next</span> <span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>plist-put eww-data elem <span class="org-rainbow-delimiters-depth-7">(</span>plist-get old-data elem<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>run-hooks 'eww-after-render-hook<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

</pre>
</div>

<p>
但有个问题就是回退的时候，退不到我们的索引页面，原因是 `eww-follow-link' 中
检查了访问 url 的构成，只有同一个页面的才会调用 `eww-save-history'，我不知道
作者是怎么考虑的，反正我给加个补丁，不管到什么 url 都调用 `eww-save-history'
保存当前页面。
</p>

<p>
第二是他可能会使用外部浏览器打开页面。其实，Emacs 支持打开的页面已经完全可以
满足我的需要了，于是将 `browse-url-browser-function' 设置为 `eww-browse-url'。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> browse-url-browser-function 'eww-browse-url<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> shr-external-browser <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">(</span>url <span class="org-type">&amp;rest</span> args<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>apply 'browse-url-xdg-open url args<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>eval-after-load 'browse-url
  '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">browse-url-default-browser</span> <span class="org-rainbow-delimiters-depth-3">(</span>url <span class="org-type">&amp;rest</span> args<span class="org-rainbow-delimiters-depth-3">)</span>
     <span class="org-doc">" Use EWW as the default browser for search web package. But</span>
<span class="org-doc">you should set the variable `</span><span class="org-doc"><span class="org-constant">shr-external-browser</span></span><span class="org-doc">' to</span>
<span class="org-doc">browse-url-xdg-open to make `</span><span class="org-doc"><span class="org-constant">eww-browse-with-external-browser</span></span><span class="org-doc">' to</span>
<span class="org-doc">work as expected."</span>
     <span class="org-rainbow-delimiters-depth-3">(</span>apply 'eww-browse-url
            url args<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">eww-follow-link-before-advice</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">&amp;optional</span> external mouse-event<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>eww-save-history<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>advice-add 'eww-follow-link <span class="org-builtin">:before</span> #'eww-follow-link-before-advice<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
本作品采用<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">知识共享署名-非商业性使用-禁止演绎 3.0 未本地化版本许可协议</a> 进行许可。
</p>
</div>
</li>
</ol>
</div>
</div>
</body>
</html>